nxp-mcuxpresso/mcux-soc-svd/MCXA256/MCXA256.xml
        <register>
          <name>SCAPABILITIES</name>
          <description>Target Capabilities</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0xE83FFE70</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IDENA</name>
              <description>ID 48b Handler</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>APPLICATION</name>
                  <description>Application</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HW</name>
                  <description>Hardware</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HW_BUT</name>
                  <description>Hardware, but the I3C module instance handles ID 48b</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PARTNO</name>
                  <description>A part number register (PARTNO)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IDREG</name>
              <description>ID Register</description>
              <bitOffset>2</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALL_DISABLED</name>
                  <description>All ID register features disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ID_INSTANCE</name>
                  <description>ID Instance is a register; used if there is no PARTNO register</description>
                  <value>#xxx1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IDRAND</name>
                  <description>An ID Random field is available</description>
                  <value>#xx1x</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCR</name>
                  <description>A Device Characteristic Register (DCR) is available</description>
                  <value>#x1xx</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BCR</name>
                  <description>A Bus Characteristics Register (BCR) is available</description>
                  <value>#1xxx</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HDRSUPP</name>
              <description>High Data Rate Support</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_HDR</name>
                  <description>No HDR modes supported</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DDR</name>
                  <description>DDR mode supported</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MASTER</name>
              <description>Controller</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASTERNOTSUPPORTED</name>
                  <description>Not supported</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASTERSUPPORTED</name>
                  <description>Supported</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SADDR</name>
              <description>Static Address</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_STATIC</name>
                  <description>No static address</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STATIC</name>
                  <description>Static address is fixed in hardware</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HW_CONTROL</name>
                  <description>Hardware controls the static address dynamically (for example, from the pin strap)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONFIG</name>
                  <description>SCONFIG register supplies the static address</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CCCHANDLE</name>
              <description>Common Command Codes Handling</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALL_DISABLED</name>
                  <description>All handling features disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLOCK_HANDLE</name>
                  <description>The I3C module manages events, activities, status, HDR, and if enabled for it, ID and static-address-related items</description>
                  <value>#xxx1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAX_READ_WRITE</name>
                  <description>The I3C module manages maximum read and write lengths, and max data speed</description>
                  <value>#xx1x</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PENDINT_ACTSTATE</name>
                  <description>GETSTATUS CCC returns the values of SCTRL[PENDINT] and SCTRL[ACTSTATE]</description>
                  <value>#x1xx</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VENDINFO</name>
                  <description>GETSTATUS CCC returns the value of SCTRL[VENDINFO]</description>
                  <value>#1xxx</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IBI_MR_HJ</name>
              <description>In-Band Interrupts, Controller Requests, Hot-Join Events</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALL_DISABLED</name>
                  <description>Application cannot generate IBI, CR, or HJ</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IBI</name>
                  <description>Application can generate an IBI</description>
                  <value>#xxxx1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IBI_HAS_DATA</name>
                  <description>When bit 0 = 1, the IBI has data from the SCTRL register</description>
                  <value>#xxx1x</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASTER_REQUEST</name>
                  <description>Application can generate a controller request for a secondary controller</description>
                  <value>#xx1xx</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HOT_JOIN</name>
                  <description>Application can generate a Hot-Join event</description>
                  <value>#x1xxx</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BAMATCH_FOR_BUS</name>
                  <description>Application can use SCONFIG[BAMATCH] for bus-available timing</description>
                  <value>#1xxxx</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMECTRL</name>
              <description>Time Control</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_TIME_CONTROL_TYPE</name>
                  <description>No time control supported</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ATLEAST1_TIME_CONTROL</name>
                  <description>At least one time-control type supported</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTFIFO</name>
              <description>External FIFO</description>
              <bitOffset>23</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_EXT_FIFO</name>
                  <description>No external FIFO available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STD_EXT_FIFO</name>
                  <description>Standard available or free external FIFO</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REQUEST_EXT_FIFO</name>
                  <description>Request track external FIFO</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIFOTX</name>
              <description>FIFO Transmit</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FIFO_2BYTE</name>
                  <description>Two</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIFO_4BYTE</name>
                  <description>Four</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIFO_8BYTE</name>
                  <description>Eight</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIFO_16BYTE</name>
                  <description>16 or larger</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIFORX</name>
              <description>FIFO Receive</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FIFO_2BYTE</name>
                  <description>Two or three</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIFO_4BYTE</name>
                  <description>Four</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIFO_8BYTE</name>
                  <description>Eight</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIFO_16BYTE</name>
                  <description>16 or larger</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INT</name>
              <description>Interrupts</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTERRUPTSNO</name>
                  <description>Not supported</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTERRUPTSYES</name>
                  <description>Supported</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA</name>
              <description>Direct Memory Access</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMANO</name>
                  <description>Not supported</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAYES</name>
                  <description>Supported</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SDYNADDR</name>
          <description>Target Dynamic Address</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAVALID</name>
              <description>Dynamic Address Valid</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DANOTASSIGNED</name>
                  <description>DANOTASSIGNED: a dynamic address is not assigned</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAASSIGNED</name>
                  <description>DAASSIGNED: a dynamic address is assigned</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DADDR</name>
              <description>Dynamic Address</description>
              <bitOffset>1</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAPSA</name>
              <description>Map a Static Address</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SA10B</name>
              <description>10-Bit Static Address</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>KEY</name>
              <description>Key</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SMAXLIMITS</name>
          <description>Target Maximum Limits</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MAXRD</name>
              <description>Maximum Read Length</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAXWR</name>
              <description>Maximum Write Length</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SIDPARTNO</name>
          <description>Target ID Part Number</description>
          <addressOffset>0x6C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x30000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PARTNO</name>
              <description>Part Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SIDEXT</name>
          <description>Target ID Extension</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x66EF00</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCR</name>
              <description>Device Characteristic Register</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BCR</name>
              <description>Bus Characteristics Register</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SVENDORID</name>
          <description>Target Vendor ID</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x11B</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VID</name>
              <description>Vendor ID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STCCLOCK</name>
          <description>Target Time Control Clock</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3014</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ACCURACY</name>
              <description>Clock Accuracy</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FREQ</name>
              <description>Clock Frequency</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SMSGMAPADDR</name>
          <description>Target Message Map Address</description>
          <addressOffset>0x7C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MAPLAST</name>
              <description>Matched Address Index</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LASTSTATIC</name>
              <description>Last Static Address Matched</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>I3C</name>
                  <description>I3C dynamic address</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C</name>
                  <description>I2C static address</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MAPLASTM1</name>
              <description>Matched Previous Address Index 1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MAPLASTM2</name>
              <description>Matched Previous Index 2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
