nxp-mcuxpresso/mcux-soc-svd/MCXA256/MCXA256.xml
          <register>
            <name>TCD_BITER_ELINKNO</name>
            <description>TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled)</description>
            <alternateGroup>ELINKNO</alternateGroup>
            <addressOffset>0x3E</addressOffset>
            <size>16</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0</resetMask>
            <fields>
              <field>
                <name>BITER</name>
                <description>Starting Major Iteration Count</description>
                <bitOffset>0</bitOffset>
                <bitWidth>15</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>ELINK</name>
                <description>Enables Link</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLE</name>
                    <description>Channel-to-channel linking disabled</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLE</name>
                    <description>Channel-to-channel linking enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>TCD_BITER_ELINKYES</name>
            <description>TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled)</description>
            <alternateGroup>ELINKYES</alternateGroup>
            <addressOffset>0x3E</addressOffset>
            <size>16</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0</resetMask>
            <fields>
              <field>
                <name>BITER</name>
                <description>Starting Major Iteration Count</description>
                <bitOffset>0</bitOffset>
                <bitWidth>9</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>LINKCH</name>
                <description>Link Channel Number</description>
                <bitOffset>9</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>ELINK</name>
                <description>Enable Link</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLE</name>
                    <description>Channel-to-channel linking disabled</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLE</name>
                    <description>Channel-to-channel linking enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
      </registers>
    </peripheral>
    <peripheral>
      <name>AOI0</name>
      <description>AOI</description>
      <groupName>AOI</groupName>
      <headerStructName>AOI</headerStructName>
      <baseAddress>0x40089000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>BFCRT010</name>
          <description>Boolean Function Term 0 and 1 Configuration for EVENT0</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>PT1_DC</name>
              <description>Product Term 1, Input D Configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FORCE_0</name>
                  <description>Force input D to become 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PASS</name>
                  <description>Pass input D</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMPLEMENT</name>
                  <description>Complement input D</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FORCE_1</name>
                  <description>Force input D to become 1</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PT1_CC</name>
              <description>Product Term 1, Input C Configuration</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FORCE_0</name>
                  <description>Force input C to become 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PASS</name>
                  <description>Pass input C</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMPLEMENT</name>
                  <description>Complement input C</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FORCE_1</name>
                  <description>Force input C to become 1</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PT1_BC</name>
              <description>Product Term 1, Input B Configuration</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FORCE_0</name>
                  <description>Force input B to become 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PASS</name>
                  <description>Pass input B</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMPLEMENT</name>
                  <description>Complement input B</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FORCE_1</name>
                  <description>Force input B to become 1</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PT1_AC</name>
              <description>Product Term 1, Input A Configuration</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FORCE_0</name>
                  <description>Force input A to become 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PASS</name>
                  <description>Pass input A</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMPLEMENT</name>
                  <description>Complement input A</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FORCE_1</name>
                  <description>Force input A to become 1</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PT0_DC</name>
              <description>Product Term 0, Input D Configuration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FORCE_0</name>
                  <description>Force input D to become 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PASS</name>
                  <description>Pass input D</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMPLEMENT</name>
                  <description>Complement input D</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FORCE_1</name>
                  <description>Force input D to become 1</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PT0_CC</name>
              <description>Product Term 0, Input C Configuration</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FORCE_0</name>
                  <description>Force input C to become 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PASS</name>
                  <description>Pass input C</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMPLEMENT</name>
                  <description>Complement input C</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FORCE_1</name>
                  <description>Force input C to become 1</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PT0_BC</name>
              <description>Product Term 0, Input B Configuration</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FORCE_0</name>
                  <description>Force input B to become 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PASS</name>
                  <description>Pass input B</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMPLEMENT</name>
                  <description>Complement input B</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FORCE_1</name>
                  <description>Force input B to become 1</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PT0_AC</name>
              <description>Product Term 0, Input A Configuration</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FORCE_0</name>
                  <description>Force input A to become 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PASS</name>
                  <description>Pass input A</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMPLEMENT</name>
                  <description>Complement input A</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FORCE_1</name>
                  <description>Force input A to become 1</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BFCRT230</name>
          <description>Boolean Function Term 2 and 3 Configuration for EVENT0</description>
          <addressOffset>0x2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>PT3_DC</name>
              <description>Product Term 3, Input D Configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FORCE_0</name>
                  <description>Force input D to become 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PASS</name>
                  <description>Pass input D</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMPLEMENT</name>
                  <description>Complement input D</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FORCE_1</name>
                  <description>Force input D to become 1</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PT3_CC</name>
              <description>Product Term 3, Input C Configuration</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FORCE_0</name>
                  <description>Force input C to become 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PASS</name>
                  <description>Pass input C</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMPLEMENT</name>
                  <description>Complement input C</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FORCE_1</name>
                  <description>Force input C to become 1</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PT3_BC</name>
              <description>Product Term 3, Input B Configuration</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FORCE_0</name>
                  <description>Force input B to become 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PASS</name>
                  <description>Pass input B</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMPLEMENT</name>
                  <description>Complement input B</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FORCE_1</name>
                  <description>Force input B to become 1</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PT3_AC</name>
              <description>Product Term 3, Input A Configuration</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FORCE_0</name>
                  <description>Force input A to become 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PASS</name>
                  <description>Pass input A</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMPLEMENT</name>
                  <description>Complement input A</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FORCE_1</name>
                  <description>Force input to become 1</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PT2_DC</name>
              <description>Product Term 2, Input D Configuration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FORCE_0</name>
                  <description>Force input D to become 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PASS</name>
                  <description>Pass input D</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMPLEMENT</name>
                  <description>Complement input D</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FORCE_1</name>
                  <description>Force input D to become 1</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PT2_CC</name>
              <description>Product Term 2, Input C Configuration</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FORCE_0</name>
                  <description>Force input C to become 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PASS</name>
                  <description>Pass input C</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMPLEMENT</name>
                  <description>Complement input C</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FORCE_1</name>
                  <description>Force input C to become 1</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PT2_BC</name>
              <description>Product Term 2, Input B Configuration</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FORCE_0</name>
                  <description>Force input B to become 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PASS</name>
                  <description>Pass input B</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMPLEMENT</name>
                  <description>Complement input B</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FORCE_1</name>
                  <description>Force input B to become 1</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PT2_AC</name>
              <description>Product Term 2, Input A Configuration</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FORCE_0</name>
                  <description>Force input A to become 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PASS</name>
                  <description>Pass input A</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMPLEMENT</name>
                  <description>Complement input A</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FORCE_1</name>
                  <description>Force input A to become 1</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
