nxp-mcuxpresso/mcux-soc-svd/MCXA256/MCXA256.xml
        <register>
          <name>ICR16</name>
          <description>Interrupt Control 16</description>
          <addressOffset>0xC0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IRQC</name>
              <description>Interrupt Configuration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>irqc0</name>
                  <description>ISF is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc1</name>
                  <description>ISF and DMA request on rising edge</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc2</name>
                  <description>ISF and DMA request on falling edge</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc3</name>
                  <description>ISF and DMA request on either edge</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc5</name>
                  <description>ISF sets on rising edge</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc6</name>
                  <description>ISF sets on falling edge</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc7</name>
                  <description>ISF sets on either edge</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc8</name>
                  <description>ISF and interrupt when logic 0</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc9</name>
                  <description>ISF and interrupt on rising edge</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc10</name>
                  <description>ISF and interrupt on falling edge</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc11</name>
                  <description>ISF and Interrupt on either edge</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc12</name>
                  <description>ISF and interrupt when logic 1</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc13</name>
                  <description>Enable active-high trigger output; ISF on rising edge (pin state is ORed with other enabled triggers to generate the output trigger for use by other peripherals)</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc14</name>
                  <description>Enable active-low trigger output; ISF on falling edge (pin state is inverted and ORed with other enabled triggers to generate the output trigger for use by other peripherals)</description>
                  <value>0xE</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ISF</name>
              <description>Interrupt Status Flag</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>isf0</name>
                  <description>Not detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>isf1</name>
                  <description>Detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ICR17</name>
          <description>Interrupt Control 17</description>
          <addressOffset>0xC4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IRQC</name>
              <description>Interrupt Configuration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>irqc0</name>
                  <description>ISF is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc1</name>
                  <description>ISF and DMA request on rising edge</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc2</name>
                  <description>ISF and DMA request on falling edge</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc3</name>
                  <description>ISF and DMA request on either edge</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc5</name>
                  <description>ISF sets on rising edge</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc6</name>
                  <description>ISF sets on falling edge</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc7</name>
                  <description>ISF sets on either edge</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc8</name>
                  <description>ISF and interrupt when logic 0</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc9</name>
                  <description>ISF and interrupt on rising edge</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc10</name>
                  <description>ISF and interrupt on falling edge</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc11</name>
                  <description>ISF and Interrupt on either edge</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc12</name>
                  <description>ISF and interrupt when logic 1</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc13</name>
                  <description>Enable active-high trigger output; ISF on rising edge (pin state is ORed with other enabled triggers to generate the output trigger for use by other peripherals)</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc14</name>
                  <description>Enable active-low trigger output; ISF on falling edge (pin state is inverted and ORed with other enabled triggers to generate the output trigger for use by other peripherals)</description>
                  <value>0xE</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ISF</name>
              <description>Interrupt Status Flag</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>isf0</name>
                  <description>Not detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>isf1</name>
                  <description>Detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ICR18</name>
          <description>Interrupt Control 18</description>
          <addressOffset>0xC8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IRQC</name>
              <description>Interrupt Configuration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>irqc0</name>
                  <description>ISF is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc1</name>
                  <description>ISF and DMA request on rising edge</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc2</name>
                  <description>ISF and DMA request on falling edge</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc3</name>
                  <description>ISF and DMA request on either edge</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc5</name>
                  <description>ISF sets on rising edge</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc6</name>
                  <description>ISF sets on falling edge</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc7</name>
                  <description>ISF sets on either edge</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc8</name>
                  <description>ISF and interrupt when logic 0</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc9</name>
                  <description>ISF and interrupt on rising edge</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc10</name>
                  <description>ISF and interrupt on falling edge</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc11</name>
                  <description>ISF and Interrupt on either edge</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc12</name>
                  <description>ISF and interrupt when logic 1</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc13</name>
                  <description>Enable active-high trigger output; ISF on rising edge (pin state is ORed with other enabled triggers to generate the output trigger for use by other peripherals)</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc14</name>
                  <description>Enable active-low trigger output; ISF on falling edge (pin state is inverted and ORed with other enabled triggers to generate the output trigger for use by other peripherals)</description>
                  <value>0xE</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ISF</name>
              <description>Interrupt Status Flag</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>isf0</name>
                  <description>Not detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>isf1</name>
                  <description>Detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ICR19</name>
          <description>Interrupt Control 19</description>
          <addressOffset>0xCC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IRQC</name>
              <description>Interrupt Configuration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>irqc0</name>
                  <description>ISF is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc1</name>
                  <description>ISF and DMA request on rising edge</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc2</name>
                  <description>ISF and DMA request on falling edge</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc3</name>
                  <description>ISF and DMA request on either edge</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc5</name>
                  <description>ISF sets on rising edge</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc6</name>
                  <description>ISF sets on falling edge</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc7</name>
                  <description>ISF sets on either edge</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc8</name>
                  <description>ISF and interrupt when logic 0</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc9</name>
                  <description>ISF and interrupt on rising edge</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc10</name>
                  <description>ISF and interrupt on falling edge</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc11</name>
                  <description>ISF and Interrupt on either edge</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc12</name>
                  <description>ISF and interrupt when logic 1</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc13</name>
                  <description>Enable active-high trigger output; ISF on rising edge (pin state is ORed with other enabled triggers to generate the output trigger for use by other peripherals)</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc14</name>
                  <description>Enable active-low trigger output; ISF on falling edge (pin state is inverted and ORed with other enabled triggers to generate the output trigger for use by other peripherals)</description>
                  <value>0xE</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ISF</name>
              <description>Interrupt Status Flag</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>isf0</name>
                  <description>Not detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>isf1</name>
                  <description>Detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
